package com.alevel.adv.lesson2;
//Создать класс, который будет сообщать, является ли целое число, хранящееся в классе, чётным или нет.
public class Lesson2Dz1 {
    public static void main(String[] args) {
        int number=1;
        if (number%2==0){
            System.out.println("Число четное");
        } else {
            System.out.println("число нечетное");
        }
    }
}
